IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/hercules/hercules_usb_ohci_tms570ls3x.xml
<module name="OHCI" acronym="" XML_version="1.0" HW_revision="n/a" description="">
  <register id="HCREVISION" acronym="HCREVISION" offset="0x0" width="32" description="OHCI revision number">
    <bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x000000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="REV" width="8" begin="7" end="0" resetval="0x10" description="OHCI specification revision the OHCI revision number upon which the USB host controller is based.Examples: 0x10 for 1.0 0x21 for 2.1" range="" rwaccess="R"/>
  </register>
  <register id="HCCONTROL" acronym="HCCONTROL" offset="0x4" width="32" description="HC Operating Mode Register">
    <bitfield id="RESERVED" width="21" begin="31" end="11" resetval="0x000000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="RWE" width="1" begin="10" end="10" resetval="0" description="Remote wake-up enableThis bit is used to enable or disable the remote wakeup feature upon detection of upstream resume signaling. ." range="" rwaccess="RW"/>
    <bitfield id="RWC" width="1" begin="9" end="9" resetval="0" description="Remote wake-up connected.This bit indicates whether the host controller supports remote wakeup signaling. ." range="" rwaccess="RW"/>
    <bitfield id="IR" width="1" begin="8" end="8" resetval="0" description="Interrupt routing.This bit determines the routing of interrupts generated by events registered in USBHOST.. ." range="" rwaccess="RW">
      <bitenum value="0" token="IR_0" description="All interrupts are routed to the normal host bus interrupt mechanism."/>
      <bitenum value="1" token="IR_1" description="interrupts are routed to the system management Interrupt."/>
    </bitfield>
    <bitfield id="HCFS" width="2" begin="7" end="6" resetval="0x0" description="Host Controller Functional State" range="" rwaccess="RW">
      <bitenum value="0" token="HCFS_0" description="HCFS: USB Reset"/>
      <bitenum value="1" token="HCFS_1" description="HCFS: USB Resume"/>
      <bitenum value="2" token="HCFS_2" description="HCFS: USB Operational"/>
      <bitenum value="3" token="HCFS_3" description="HCFS: USB Suspend"/>
    </bitfield>
    <bitfield id="BLE" width="1" begin="5" end="5" resetval="0" description="Bulk list processing enable." range="" rwaccess="RW">
      <bitenum value="0" token="BLE_0" description="Bulk ED list is not processed after the next SOF."/>
      <bitenum value="1" token="BLE_1" description="Enables processing of bulk ED list in the next frame."/>
    </bitfield>
    <bitfield id="CLE" width="1" begin="4" end="4" resetval="0" description="Control list processing enable." range="" rwaccess="RW">
      <bitenum value="0" token="CLE_0" description="Control ED list is not processed after the next SOF."/>
      <bitenum value="1" token="CLE_1" description="Enables processing of control ED list in the next frame."/>
    </bitfield>
    <bitfield id="IE" width="1" begin="3" end="3" resetval="0" description="Isochronous ED processing enabled by Host Controller Driver." range="" rwaccess="RW">
      <bitenum value="0" token="IE_0" description="Isochronous EDs are not processed"/>
      <bitenum value="1" token="IE_1" description="Enables processing of isochronous EDs."/>
    </bitfield>
    <bitfield id="PLE" width="1" begin="2" end="2" resetval="0" description="Periodic list enable" range="" rwaccess="RW">
      <bitenum value="0" token="PLE_0" description="Periodic ED lists are not processed after the next frame."/>
      <bitenum value="1" token="PLE_1" description="Enables processing of periodic ED lists in the next frame."/>
    </bitfield>
    <bitfield id="CBSR" width="2" begin="1" end="0" resetval="0x0" description="Control/bulk service ratio. Specifies the ratio between control and bulk EDs processed in a frame." range="" rwaccess="RW">
      <bitenum value="0" token="CBSR_0" description="One control ED per bulk ED"/>
      <bitenum value="1" token="CBSR_1" description="Two control ED per bulk ED"/>
      <bitenum value="2" token="CBSR_2" description="Three control ED per bulk ED"/>
      <bitenum value="3" token="CBSR_3" description="Four control ED per bulk ED"/>
    </bitfield>
  </register>
  <register id="HCCOMMANDSTATUS" acronym="HCCOMMANDSTATUS" offset="0x8" width="32" description="HC Command and Status">
    <bitfield id="RESERVED" width="14" begin="31" end="18" resetval="0x0000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="SOC" width="2" begin="17" end="16" resetval="0x0" description="Scheduling overrun count.This is used to monitor any persistent scheduling problems. . These bits are incremented on each scheduling overrun error. It is initialized to 0x0 and wraps around at 0x3. ." range="" rwaccess="R"/>
    <bitfield id="RESERVED" width="12" begin="15" end="4" resetval="0x000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="OCR" width="1" begin="3" end="3" resetval="0" description="Ownership change request.This bit is set to request a change of control of the host controller. ." range="" rwaccess="RW"/>
    <bitfield id="BLF" width="1" begin="2" end="2" resetval="0" description="Bulk list filled.This bit is used to indicate whether there are any TDs on the bulk list. It is set whenever it adds a TD to an ED in the bulk list. ." range="" rwaccess="RW"/>
    <bitfield id="CLF" width="1" begin="1" end="1" resetval="0" description="Control list filled.This bit is used to indicate whether there are any TDs on the control list. It is set whenever it adds a TD to an ED in the control list. ." range="" rwaccess="RW"/>
    <bitfield id="HCR" width="1" begin="0" end="0" resetval="0" description="Host controller reset. (software reset) Set this bit to initiate a USB host controller reset. This resets most USB host controller OHCI registers. OHCI register accesses must not be attempted until a read of this register returns a 0." range="" rwaccess="RW">
      <bitenum value="0" token="HCR_0" description="No effect"/>
      <bitenum value="1" token="HCR_1" description="USB host controller is reset."/>
    </bitfield>
  </register>
  <register id="HCINTERRUPTSTATUS" acronym="HCINTERRUPTSTATUS" offset="0xC" width="32" description="HC Interrupt Status">
    <bitfield id="RESERVED" width="1" begin="31" end="31" resetval="0" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="OC" width="1" begin="30" end="30" resetval="0" description="Ownership change.This bit is set when the USBHOST.[3] OCR bit is set. ." range="" rwaccess="R">
      <bitenum value="1" token="OC_1_r" description="An ownership change has occurred."/>
      <bitenum value="0" token="OC_0_w" description="No effect"/>
      <bitenum value="1" token="OC_1_w" description="Clears this bit"/>
    </bitfield>
    <bitfield id="RESERVED" width="23" begin="29" end="7" resetval="0x000000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="RHSC" width="1" begin="6" end="6" resetval="0" description="Root hub status change.When 0x1: A root hub status change has occurred.Write 0x0: No effect.Write 0x1: Clears this bit." range="" rwaccess="RW"/>
    <bitfield id="FNO" width="1" begin="5" end="5" resetval="0" description="Frame number overflow.When 0x1: A frame number overflow has occurred.Write 0x0: No effect.Write 0x1: Clears this bit." range="" rwaccess="RW"/>
    <bitfield id="UE" width="1" begin="4" end="4" resetval="0" description="Unrecoverable error.When 0x1: An unrecoverable error has occurred.Write 0x0: No effect.Write 0x1: Clears this bit." range="" rwaccess="RW"/>
    <bitfield id="RD" width="1" begin="3" end="3" resetval="0" description="Resume detected.When 0x1: A downstream device has issued a resume request.Write 0x0: No effect.Write 0x1: Clears this bit." range="" rwaccess="RW"/>
    <bitfield id="SF" width="1" begin="2" end="2" resetval="0" description="Start of frame.When 0x1: A SOF has been issued.Write 0x0: No effect.Write 0x1: Clears this bit." range="" rwaccess="RW"/>
    <bitfield id="WDH" width="1" begin="1" end="1" resetval="0" description="Write done head.When 0x1: The USB host controller has updated the HCDONEHEAD register.Write 0x0: No effect.Write 0x1: Clears this bit." range="" rwaccess="RW"/>
    <bitfield id="SO" width="1" begin="0" end="0" resetval="0" description="Scheduling overrun.When 0x1: A scheduling overrun has occurred.Write 0x0: No effect.Write 0x1: Clears this bit" range="" rwaccess="RW"/>
  </register>
  <register id="HCINTERRUPTENABLE" acronym="HCINTERRUPTENABLE" offset="0x10" width="32" description="HC Interrupt Enable">
    <bitfield id="MIE" width="1" begin="31" end="31" resetval="0" description="Master interrupt enable.When 0x1: Allows other enabled OHCI interrupt sources to propagate to the device interrupt controller.When 0x0: OHCI interrupt sources are ignored.Write 0x0: No effect.Write 0x1: Sets this bit." range="" rwaccess="RW"/>
    <bitfield id="OC" width="1" begin="30" end="30" resetval="0" description="Ownership change." range="" rwaccess="RW">
      <bitenum value="0" token="OC_0_w" description="No effect."/>
      <bitenum value="1" token="OC_1_w" description="Enable interrupt generation due to ownership change."/>
    </bitfield>
    <bitfield id="RESERVED" width="23" begin="29" end="7" resetval="0x000000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="RHSC" width="1" begin="6" end="6" resetval="0" description="Root hub status change.When 0x1 and MIE is 0x1: Allows root hub status change interrupts to propagate to the device interrupt controller.When 0x0 or MIE is 0x0: Root hub status change interrupts do not propagate.Write 0x0: No effect.Write 0x1: Sets this bit." range="" rwaccess="RW"/>
    <bitfield id="FNO" width="1" begin="5" end="5" resetval="0" description="Frame number overflow.When 0x1 and MIE is 0x1: Allows FNO interrupts to propagate to the device interrupt controller.When 0x0 or MIE is 0x0: FNO interrupts do not propagate.Write 0x0: No effect.Write 0x1: Sets this bit." range="" rwaccess="RW"/>
    <bitfield id="UE" width="1" begin="4" end="4" resetval="0" description="Unrecoverable error.When 0x1 and MIE is 0x1: Allows UE interrupts to propagate to the device interrupt controller.When 0x0 or MIE is 0x0: UE interrupts do not propagate.Write 0x0: No effect.Write 0x1: Sets this bit." range="" rwaccess="RW"/>
    <bitfield id="RD" width="1" begin="3" end="3" resetval="0" description="Resume detected.When 0x1 and MIE is 0x1: Allows RD interrupts to propagate to the device interrupt controller.When 0x0 or MIE is 0x0: RD interrupts do not propagate.Write 0x0: No effect.Write 0x1: Sets this bit." range="" rwaccess="RW"/>
    <bitfield id="SF" width="1" begin="2" end="2" resetval="0" description="Start of frame.When 0x1 and MIE is 0x1: Allows SF interrupts to propagate to the device interrupt controller.When 0x0 or MIE is 0x0: SF interrupts do not propagate.Write 0x0: No effect.Write 0x1: Sets this bit." range="" rwaccess="RW"/>
    <bitfield id="WDH" width="1" begin="1" end="1" resetval="0" description="Write done head.When 0x1 and MIE is 0x1: Allows WDH interrupts to propagate to the device interrupt controller.When 0x0 or MIE is 0x0: WDH interrupts do not propagate.Write 0x0: No effect.Write 0x1: Sets this bit." range="" rwaccess="RW"/>
    <bitfield id="SO" width="1" begin="0" end="0" resetval="0" description="Scheduling overrun.When 0x1 and MIE is 0x1: Allows SO interrupts to propagate to the device interrupt controller.When 0x0 or MIE is 0x0: SO interrupts do not propagate.Write 0x0: No effect.Write 0x1: Sets this bit." range="" rwaccess="RW"/>
  </register>
  <register id="HCINTERRUPTDISABLE" acronym="HCINTERRUPTDISABLE" offset="0x14" width="32" description="HC Interrupt Disable">
    <bitfield id="MIE" width="1" begin="31" end="31" resetval="0" description="Master interrupt enable.Always reads 0x0.Write 0x0: No effect.Write 0x1: Clears the HCINTERRUPTENABLE MIE bit." range="" rwaccess="RW"/>
    <bitfield id="OC" width="1" begin="30" end="30" resetval="0" description="Ownership change." range="" rwaccess="RW">
      <bitenum value="0" token="OC_0_w" description="No effect."/>
      <bitenum value="1" token="OC_1_w" description="Disable interrupt generation due to ownership change."/>
    </bitfield>
    <bitfield id="RESERVED" width="23" begin="29" end="7" resetval="0x000000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="RHSC" width="1" begin="6" end="6" resetval="0" description="Root hub status change.Always reads 0x0.Write 0x0: No effect.Write 0x1: Clears the HCINTERRUPTENABLE RHSC bit." range="" rwaccess="RW"/>
    <bitfield id="FNO" width="1" begin="5" end="5" resetval="0" description="Frame number overflow.Always reads 0x0.Write 0x0: No effect.Write 0x1: Clears the HCINTERRUPTENABLE FNO bit." range="" rwaccess="RW"/>
    <bitfield id="UE" width="1" begin="4" end="4" resetval="0" description="Unrecoverable error.Always reads 0x0.Write 0x0: No effect.Write 0x1: Clears the HCINTERRUPTENABLE UE bit." range="" rwaccess="RW"/>
    <bitfield id="RD" width="1" begin="3" end="3" resetval="0" description="Resume detected.Always reads 0x0.Write 0x0: No effect.Write 0x1: Clears the HCINTERRUPTENABLE RD bit." range="" rwaccess="RW"/>
    <bitfield id="SF" width="1" begin="2" end="2" resetval="0" description="Start of frame.Always reads 0x0.Write 0x0: No effect.Write 0x1: Clears the HCINTERRUPTENABLE SF bit." range="" rwaccess="RW"/>
    <bitfield id="WDH" width="1" begin="1" end="1" resetval="0" description="Write done head.Always reads 0x0.Write 0x0: No effect.Write 0x1: Clears the HCINTERRUPTENABLE WDH bit." range="" rwaccess="RW"/>
    <bitfield id="SO" width="1" begin="0" end="0" resetval="0" description="Scheduling overrun.Always reads 0x0.Write 0x0: No effect.Write 0x1: Clears the HCINTERRUPTENABLE SO bit." range="" rwaccess="RW"/>
  </register>
  <register id="HCHCCA" acronym="HCHCCA" offset="0x18" width="32" description="HC HCCA Address Register">
    <bitfield id="HCCA" width="24" begin="31" end="8" resetval="0x000000" description="Physical address of the beginning of the HCCA." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="8" begin="7" end="0" resetval="0x00" description="Reserved" range="" rwaccess="R"/>
  </register>
  <register id="HCPERIODCURRENTED" acronym="HCPERIODCURRENTED" offset="0x1C" width="32" description="HC Current Periodic Register">
    <bitfield id="PCED" width="28" begin="31" end="4" resetval="0x0000000" description="Physical address of current ED on the periodic ED list." range="" rwaccess="R"/>
    <bitfield id="RESERVED" width="4" begin="3" end="0" resetval="0x0" description="Reserved" range="" rwaccess="R"/>
  </register>
  <register id="HCCONTROLHEADED" acronym="HCCONTROLHEADED" offset="0x20" width="32" description="HC Head Control Register">
    <bitfield id="CHED" width="28" begin="31" end="4" resetval="0x0000000" description="Physical address of head ED on the control ED list." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="4" begin="3" end="0" resetval="0x0" description="Reserved" range="" rwaccess="R"/>
  </register>
  <register id="HCCONTROLCURRENTED" acronym="HCCONTROLCURRENTED" offset="0x24" width="32" description="HC Current Control Register">
    <bitfield id="CCED" width="28" begin="31" end="4" resetval="0x0000000" description="Physical address of current ED on the control ED list." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="4" begin="3" end="0" resetval="0x0" description="Reserved" range="" rwaccess="R"/>
  </register>
  <register id="HCBULKHEADED" acronym="HCBULKHEADED" offset="0x28" width="32" description="HC Head Bulk Register">
    <bitfield id="BHED" width="28" begin="31" end="4" resetval="0x0000000" description="Physical address of head ED on the bulk ED list." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="4" begin="3" end="0" resetval="0x0" description="Reserved" range="" rwaccess="R"/>
  </register>
  <register id="HCBULKCURRENTED" acronym="HCBULKCURRENTED" offset="0x2C" width="32" description="HC Current Bulk Register">
    <bitfield id="BCED" width="28" begin="31" end="4" resetval="0x0000000" description="Physical address of current ED on the bulk ED list." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="4" begin="3" end="0" resetval="0x0" description="Reserved" range="" rwaccess="R"/>
  </register>
