IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/hercules/hercules_usb_ohci_tms570ls3x.xml
  <register id="HCDONEHEAD" acronym="HCDONEHEAD" offset="0x30" width="32" description="HC Head Done Register">
    <bitfield id="DH" width="28" begin="31" end="4" resetval="0x0000000" description="Physical address of last TD that was added to the Done queue." range="" rwaccess="R"/>
    <bitfield id="RESERVED" width="4" begin="3" end="0" resetval="0x0" description="Reserved" range="" rwaccess="R"/>
  </register>
  <register id="HCFMINTERVAL" acronym="HCFMINTERVAL" offset="0x34" width="32" description="HC Frame Interval Register">
    <bitfield id="FIT" width="1" begin="31" end="31" resetval="0" description="Frame interval toggle.This bit is toggled whenever it loads a new value to FI. ." range="" rwaccess="RW"/>
    <bitfield id="FSMPS" width="15" begin="30" end="16" resetval="0x0000" description="Largest data packet size for full-speed packets, bit times.This field specifies a value which is loaded into the largest data packet counter at the beginning of each frame. ." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="2" begin="15" end="14" resetval="0x0" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="FI" width="14" begin="13" end="0" resetval="0x2EDF" description="Frame interval. Number of 12-MHz clocks in the USB frame. The nominal value is set to 11,999, to give a 1-ms frame." range="" rwaccess="RW"/>
  </register>
  <register id="HCFMREMAINING" acronym="HCFMREMAINING" offset="0x38" width="32" description="HC Frame Remaining Register">
    <bitfield id="FRT" width="1" begin="31" end="31" resetval="0" description="Frame remaining toggle.This bit is used for the synchronization between USBHOST.[13:0] FI and FR. . This bit is loaded from the USBHOST.[31] FIT field whenever FR reaches 0. ." range="" rwaccess="R"/>
    <bitfield id="RESERVED" width="17" begin="30" end="14" resetval="0x00000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="FR" width="14" begin="13" end="0" resetval="0x0000" description="Frame remaining.This counter is decremented at each bit time. When it reaches 0, it is reset by loading the USBHOST.[13:0] FI value at the next bit time boundary. ." range="" rwaccess="R"/>
  </register>
  <register id="HCFMNUMBER" acronym="HCFMNUMBER" offset="0x3C" width="32" description="HC Frame Number Register">
    <bitfield id="RESERVED" width="16" begin="31" end="16" resetval="0x0000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="FN" width="16" begin="15" end="0" resetval="0x0000" description="Frame Number.This is incremented when USBHOST. is reloaded. It is rolled over to 0x0000 after 0xFFFF. ." range="" rwaccess="R"/>
  </register>
  <register id="HCPERIODICSTART" acronym="HCPERIODICSTART" offset="0x40" width="32" description="HC Periodic Start Register">
    <bitfield id="RESERVED" width="18" begin="31" end="14" resetval="0x00000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="PS" width="14" begin="13" end="0" resetval="0x0000" description="Periodic start. The host controller driver must program this value to be about 10% less than the frame interval field value so that control and bulk EDs have priority for the first 10% of the frame; then periodic EDs have priority for the remaining 90% of the frame." range="" rwaccess="RW"/>
  </register>
  <register id="HCLSTHRESHOLD" acronym="HCLSTHRESHOLD" offset="0x44" width="32" description="HC Low-Speed Threshold Register">
    <bitfield id="RESERVED" width="20" begin="31" end="12" resetval="0x00000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="LST" width="12" begin="11" end="0" resetval="0x628" description="Low-speed threshold." range="" rwaccess="RW"/>
  </register>
  <register id="HCRHDESCRIPTORA" acronym="HCRHDESCRIPTORA" offset="0x48" width="32" description="HC Root Hub A Register">
    <bitfield id="POTPG" width="8" begin="31" end="24" resetval="0x0A" description="Power-on to power-good time. Defines the minimum amount of time (2 ms * POTPG) between the USB host controller turning on power to a downstream port and when the USB host can access the downstream device." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="11" begin="23" end="13" resetval="0x000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="NOCP" width="1" begin="12" end="12" resetval="0" description="No overcurrent protection. 0x0: Overcurrent status is reported collectively for all downstream ports.0x1: The USB host controller does not implement overcurrent protection inputs The bit must not be used, and is always written to with its default (reset) value as the hardware overcurrent inputs are tied off at device level." range="" rwaccess="RW"/>
    <bitfield id="OCPM" width="1" begin="11" end="11" resetval="1" description="Overcurrent protection mode. The bit must not be used, and is always written to with its default (reset) value as the hardware overcurrent inputs are tied off at device level." range="" rwaccess="RW"/>
    <bitfield id="DT" width="1" begin="10" end="10" resetval="0" description="Device type.Always reads 0x0: Indicates that the USB host controller implemented is not a compound device." range="" rwaccess="R"/>
    <bitfield id="NPS" width="1" begin="9" end="9" resetval="0" description="No power switching" range="" rwaccess="RW">
      <bitenum value="0" token="NPS_0" description="VBUS power switching is supported, either per-port or all-port switched per the power"/>
      <bitenum value="1" token="NPS_1" description="VBUS power switching is not supported, power is available to all downstream ports."/>
    </bitfield>
    <bitfield id="PSM" width="1" begin="8" end="8" resetval="1" description="Power switching mode." range="" rwaccess="RW">
      <bitenum value="0" token="PSM_0" description="Indicates that all ports are powered at the same time"/>
      <bitenum value="1" token="PSM_1" description="Individual port power switching is supported"/>
    </bitfield>
    <bitfield id="NDP" width="8" begin="7" end="0" resetval="0x03" description="Number of downstream ports.These bits specify the number of downstream ports supported by the root hub. It is implementation-specific. The minimum number of ports is 1. The maximum number of ports supported by OHCI is 15." range="" rwaccess="R"/>
  </register>
  <register id="HCRHDESCRIPTORB" acronym="HCRHDESCRIPTORB" offset="0x4C" width="32" description="HC Root Hub B Register">
    <bitfield id="PPCM" width="16" begin="31" end="16" resetval="0x0000" description="Port power control mask. Each bit defines whether a corresponding downstream port has port power controlled by the global power control. When set the port's power state is only affected by per-port power control. When cleared the port is controlled by the global power switch. If the device is configured to global switch mode this field is not valid. bit 0: Reserved, bit 1: Ganged-power mask on port 1, ..., bit 15: Ganged-power mask on port 15" range="" rwaccess="RW"/>
    <bitfield id="DR" width="16" begin="15" end="0" resetval="0x0000" description="Device removable. Each bit defines whether a corresponding downstream port has a removable device. When cleared the attached device is removable. When set the attached device is not removable. Bit 0: Reserved, bit 1 : Device attached to port 1, , bit 15: Device attached to port 15" range="" rwaccess="RW"/>
  </register>
  <register id="HCRHSTATUS" acronym="HCRHSTATUS" offset="0x50" width="32" description="HC Root Hub Status Register">
    <bitfield id="CRWE" width="1" begin="31" end="31" resetval="0" description="Clear remote wake-up enable.Write 0x0: No effect.Write 0x1: Clears the device remote wake-up enable bit." range="" rwaccess="W"/>
    <bitfield id="RESERVED" width="14" begin="30" end="17" resetval="0x0000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="LPSC" width="1" begin="16" end="16" resetval="0" description="Local power status change.Always reads 0x0: The Root Hub does not support the local power status featureWrite 0x0: No effect.Write 0x1: Sets port power status bits for all ports, if power switching mode is 0. Sets port power status bits for ports with their corresponding port power control mask bits cleared if power switching mode is 1." range="" rwaccess="RW"/>
    <bitfield id="DRWE" width="1" begin="15" end="15" resetval="0" description="Device remote wake-up enable. Enables a connect status change event as a resume event, causing a USB suspend to USB resume state transition and sets the resume detected interrupt status bit.Read 0x1: Connect status change is a remote wake-up event.Read 0x0: Connect status change is not a remote wake-up event.Write 0x0: No effect.Write 0x1: Sets the device remote wake-up enable bit." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="14" begin="14" end="1" resetval="0x0000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="LPS" width="1" begin="0" end="0" resetval="0" description="Local power status.Always reads 0x0.Write 0x0: No effect.Write 0x1: When in global power mode (power switching mode = 0), turns off power to all ports. If in per-port power mode (power switching mode = 1), turns of power to those ports whose corresponding port power control mask bit is 0." range="" rwaccess="RW"/>
  </register>
  <register id="HCRHPORTSTATUS_1" acronym="HCRHPORTSTATUS_1" offset="0x54" width="32" description="HC Port 1 Status and Control Register">
    <bitfield id="RESERVED" width="11" begin="31" end="21" resetval="0x000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="PRSC" width="1" begin="20" end="20" resetval="0" description="Port 1 reset status change. This bit is set when the Port 1 port reset status bit has changed.Write 0x0: No effect.Write 0x1: Clears this bit." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="1" begin="19" end="19" resetval="0" description="Reserved" range="" rwaccess="RW"/>
    <bitfield id="PSSC" width="1" begin="18" end="18" resetval="0" description="Port 1 suspend status change. This bit is set when the Port1 port suspend status has changed.Write 0x0: No effect.Write 0x1: Clears this bit." range="" rwaccess="RW"/>
    <bitfield id="PESC" width="1" begin="17" end="17" resetval="0" description="Port 1 enable status change. This bit is set when the Port1 port enable status has changed.Write 0x0: No effect.Write 0x1: Clears this bit." range="" rwaccess="RW"/>
    <bitfield id="CSC" width="1" begin="16" end="16" resetval="0" description="Port 1 connect status change. This bit is set when the Port1 port current connect status has changed due to a connect or disconnect event. If current connect status is 0 when a set port reset, set port enable, or set port suspend write occurs, this bit is set.Write 0x0: No effect.Write 0x1: Clears this bit.Note: If the DR bit HCRHDESCRIPTORB[1] is set, this bit is set only after a root hub reset to inform the system that the device is attached." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="6" begin="15" end="10" resetval="0x00" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="LSDA_CPP" width="1" begin="9" end="9" resetval="0" description="Port 1 low-speed device attached/clear port power. This bit is valid only when port 1 current connect status is 1.Read 0x0: A full-speed device is attached to port 1.Read 0x1: A low-speed device is attached to port 1.Write 0x0: No effect.Write 0x1: Clears the port 1 port power status." range="" rwaccess="RW"/>
    <bitfield id="PPS_SPP" width="1" begin="8" end="8" resetval="0" description="Port 1 port power status/set port power.Read 0x0: Port 1 power is enabled.Read 0x1: Port 1 power is not enabled.Write 0x0: No effect.Write 0x1: Sets the port 1 port power status bit." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="3" begin="7" end="5" resetval="0x0" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="PRS_SPR" width="1" begin="4" end="4" resetval="0" description="Port 1 port reset status/set port reset.Read 0x0: USB reset is not being sent to port 1.Read 0x1: Port 1 is signaling the USB reset.Write 0x0: No effect.Write 0x1: Sets the port 1 port reset status bit and causes the USB host controller to begin signaling USB reset to port 1." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="1" begin="3" end="3" resetval="0" description="Reserved" range="" rwaccess="RW"/>
    <bitfield id="PSS_SPS" width="1" begin="2" end="2" resetval="0" description="Port 1 port suspend status/set port suspend. This bit is cleared automatically at the end of the USB resume sequence and also at the end of the USB reset sequence.Write 0x0: No effect.Read 0x0: Port 1 is not in the USB suspend state.Read 0x1: Port 1 is in the USB suspend state or is in the resume sequence.Write 0x1: If port 1 current connect status is 1, sets the port 1 port suspend status bit and places port 1 in USB suspend state. If current connect status is 0, sets instead connect status change to inform the USB host controller driver of an attempt to suspend a disconnected port." range="" rwaccess="RW"/>
    <bitfield id="PES_SPE" width="1" begin="1" end="1" resetval="0" description="Port 1 port enable status/set port enable. This bit is automatically set at completion of port 1 USB reset if it was not already set before the USB reset completed, and is automatically set at the end of a USB suspend if the port was not enabled when the USB resume completed.Read 0x0: Port 1 is not enabled.Read 0x1: Port 1 is enabled.Write 0x0: No effect.Write 0x1: When port 1 current connect status is 1 sets the port 1 port enable status bit. When port 1 current status is 0 has no effect." range="" rwaccess="RW"/>
    <bitfield id="CCS_CPE" width="1" begin="0" end="0" resetval="0" description="Port 1 current connection status/clear port enable.Read 0x0: No USB device is attached to port 1.Read 0x1: Port 1 currently has a USB device attached.Write 0x0: No effect.Write 0x1: Clears the port 1 port enable bit.Note: This bit is set to 1 if the DR bit HCRHDESCRIPTORB[1] is set to indicate a non-removable device on port 1." range="" rwaccess="RW"/>
  </register>
  <register id="HCRHPORTSTATUS_2" acronym="HCRHPORTSTATUS_2" offset="0x58" width="32" description="HC Port 2 Status and Control Register">
    <bitfield id="RESERVED" width="11" begin="31" end="21" resetval="0x000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="PRSC" width="1" begin="20" end="20" resetval="0" description="Port 2 reset status change. This bit is set when the Port 2 port reset status bit has changed.Write 0x0: No effect.Write 0x1: Clears this bit." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="1" begin="19" end="19" resetval="0" description="Reserved" range="" rwaccess="RW"/>
    <bitfield id="PSSC" width="1" begin="18" end="18" resetval="0" description="Port 2 suspend status changed. This bit is set when the Port 2 port suspend status has changed.Write 0x0: No effect.Write 0x1: Clears this bit." range="" rwaccess="RW"/>
    <bitfield id="PESC" width="1" begin="17" end="17" resetval="0" description="Port 2 enable status change. This bit is set when the Port 2 port enable status has changed.Write 0x0: No effect.Write 0x1: Clears this bit." range="" rwaccess="RW"/>
    <bitfield id="CSC" width="1" begin="16" end="16" resetval="0" description="Port 2 connect status change. This bit is set when the Port 2 port current connect status has changed due to a connect or disconnect event.If current connect status is 0 when a set port reset, set port enable, or set port suspend write occurs, this bit is set.Write 0x0: No effect.Write 0x1: Clears this bit.Note: If the DR bit HCRHDESCRIPTORB[1] is set, this bit is set only after a root hub reset to inform the system that the device is attached." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="6" begin="15" end="10" resetval="0x00" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="LSDA_CPP" width="1" begin="9" end="9" resetval="0" description="Port 2 low-speed device attached/clear port power. This bit is valid only when port 2 current connect status is 1.Read 0x0: A full-speed device is attached to port 2.Read 0x1: A low-speed device is attached to port 2.Write 0x0: No effect.Write 0x1: Clears the port 2 port power status." range="" rwaccess="RW"/>
    <bitfield id="PPS_SPP" width="1" begin="8" end="8" resetval="0" description="Port 2 port power status/set port power.Read 0x0: Port 2 power is enabled.Read 0x1: Port 2 power is not enabled.Write 0x0: No effect.Write 0x1: Sets the port 2 port power status bit." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="3" begin="7" end="5" resetval="0x0" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="PRS_SPR" width="1" begin="4" end="4" resetval="0" description="Port 2 port reset status/set port reset.Read 0x0: USB reset is not being sent to port 2.Read 0x1: Port 2 is signaling the USB reset.Write 0x0: No effect.Write 0x1: Sets the port 2 port reset status bit and causes the USB host controller to begin signaling USB reset to port 2." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="1" begin="3" end="3" resetval="0" description="Reserved" range="" rwaccess="RW"/>
    <bitfield id="PSS_SPS" width="1" begin="2" end="2" resetval="0" description="Port 2 port suspend status/set port suspend. This bit is cleared automatically at the end of the USB resume sequence and also at the end of the USB reset sequence.Write 0x0: No effect.Read 0x0: Port 2 is not in the USB suspend state.Read 0x1: Port 2 is in the USB suspend state or is in the resume sequence.Write 0x1: If port 2 current connect status is 1, sets the port 2 port suspend status bit and places port 2 in USB suspend state. If current connect status is 0, sets instead connect status change to inform the USB host controller driver of an attempt to suspend a disconnected port." range="" rwaccess="RW"/>
    <bitfield id="PES_SPE" width="1" begin="1" end="1" resetval="0" description="Port 2 port enable status/set port enable. This bit is automatically set at completion of port 2 USB reset if it was not already set before the USB reset completed, and is automatically set at the end of a USB suspend if the port was not enabled when the USB resume completed.Read 0x0: Port 2 is not enabled.Read 0x1: Port 2 is enabled.Write 0x0: No effect.Write 0x1: When port 2 current connect status is 1 sets the port 2 port enable status bit. When port 2 current status is 0 has no effect." range="" rwaccess="RW"/>
    <bitfield id="CCS_CPE" width="1" begin="0" end="0" resetval="0" description="Port 2 current connection status/clear port enable.Read 0x0: No USB device is attached to port 2.Read 0x1: Port 2 currently has a USB device attached.Write 0x0: No effect.Write 0x1: Clears the port 2 port enable bit.Note: This bit is set to 1 if the DR bit HCRHDESCRIPTORB[1] is set to indicate a non-removable device on port 2." range="" rwaccess="RW"/>
  </register>
  <register id="HCRHPORTSTATUS_3" acronym="HCRHPORTSTATUS_3" offset="0x5C" width="32" description="HC Port 3 Status and Control Register">
    <bitfield id="RESERVED" width="11" begin="31" end="21" resetval="0x000" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="PRSC" width="1" begin="20" end="20" resetval="0" description="Port 3 reset status change. This bit is set when the Port 3 port reset status bit has changed.Write 0x0: No effect.Write 0x1: Clears this bit." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="1" begin="19" end="19" resetval="0" description="Reserved" range="" rwaccess="RW"/>
    <bitfield id="PSSC" width="1" begin="18" end="18" resetval="0" description="Port 3 suspend status change. This bit is set when the Port 3 port suspend status has changed.Write 0x0: No effect.Write 0x1: Clears this bit." range="" rwaccess="RW"/>
    <bitfield id="PESC" width="1" begin="17" end="17" resetval="0" description="Port 3 enable status change. This bit is set when the Port 3 port enable status has changed.Write 0x0: No effect.Write 0x1: Clears this bit." range="" rwaccess="RW"/>
    <bitfield id="CSC" width="1" begin="16" end="16" resetval="0" description="Port 3 connect status change. This bit is set when the Port 3 port current connect status has changed due to a connect or disconnect event.If current connect status is 0 when a set port reset, set port enable, or set port suspend write occurs, this bit is set.Write 0x0: No effect.Write 0x1: Clears this bit.Note: If the DR bit HCRHDESCRIPTORB[1] is set, this bit is set only after a root hub reset to inform the system that the device is attached." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="6" begin="15" end="10" resetval="0x00" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="LSDA_CPP" width="1" begin="9" end="9" resetval="0" description="Port 3 low-speed device attached/clear port power. This bit is valid only when port 3 current connect status is 1.Read 0x0: A full-speed device is attached to port 3.Read 0x1: A low-speed device is attached to port 3.Write 0x0: No effect.Write 0x1: Clears the port 3 port power status." range="" rwaccess="RW"/>
    <bitfield id="PPS_SPP" width="1" begin="8" end="8" resetval="0" description="Port 3 power status/set port power.Read 0x0: Port 3 power is enabled.Read 0x1: Port 3 power is not enabled.Write 0x0: No effect.Write 0x1: Sets the port 3 port power status bit." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="3" begin="7" end="5" resetval="0x0" description="Reserved" range="" rwaccess="R"/>
    <bitfield id="PRS_SPR" width="1" begin="4" end="4" resetval="0" description="Port 3 reset status/set port reset.Read 0x0: USB reset is not being sent to port 3.Read 0x1: Port 3 is signaling the USB reset.Write 0x0: No effect.Write 0x1: Sets the port 3 port reset status bit and causes the USB host controller to begin signaling USB reset to port 3." range="" rwaccess="RW"/>
    <bitfield id="RESERVED" width="1" begin="3" end="3" resetval="0" description="Reserved" range="" rwaccess="RW"/>
    <bitfield id="PSS_SPS" width="1" begin="2" end="2" resetval="0" description="Port 3 port suspend status/set port suspend. This bit is cleared automatically at the end of the USB resume sequence and also at the end of the USB reset sequence.Write 0x0: No effect.Read 0x0: Port 3 is not in the USB suspend state.Read 0x1: Port 3 is in the USB suspend state or is in the resume sequence.Write 0x1: If port 3 current connect status is 1, sets the port 3 port suspend status bit and places port 3 in USB suspend state. If current connect status is 0, sets instead connect status change to inform the USB host controller driver of an attempt to suspend a disconnected port." range="" rwaccess="RW"/>
    <bitfield id="PES_SPE" width="1" begin="1" end="1" resetval="0" description="Port 3 enable status/set port enable. This bit is automatically set at completion of port 3 USB reset if it was not already set before the USB reset completed, and is automatically set at the end of a USB suspend if the port was not enabled when the USB resume completed.Read 0x0: Port 3 is not enabled.Read 0x1: Port 3 is enabled.Write 0x0: No effect.Write 0x1: When port 3 current connect status is 1 sets the port 3 port enable status bit. When port 3 current status is 0 has no effect." range="" rwaccess="RW"/>
    <bitfield id="CCS_CPE" width="1" begin="0" end="0" resetval="0" description="Port 3 current connection status/clear port enable.Read 0x0: No USB device is attached to port 3.Read 0x1: Port 3 currently has a USB device attached.Write 0x0: No effect.Write 0x1: Clears the port 3 port enable bit.Note: This bit is set to 1 if the DR bit HCRHDESCRIPTORB[1] is set to indicate a non-removable device on port 3." range="" rwaccess="RW"/>
  </register>
  <register id="HOSTUEADDR" acronym="HOSTUEADDR" offset="0xE0" width="32" description="HOSTUEADDR"></register>
  <register id="HOSTUESTATUS" acronym="HOSTUESTATUS" offset="0xE4" width="32" description="HOSTUESTATUS"></register>
  <register id="HOSTTIMEOUTCTRL" acronym="HOSTTIMEOUTCTRL" offset="0xE8" width="32" description="HOSTTIMEOUTCTRL"></register>
  <register id="HOSTREVISION" acronym="HOSTREVISION" offset="0xEC" width="32" description="HOSTREVISION"></register>
</module>
